AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТабличнойЧасти</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТабличнойЧасти</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/ЗапасыСервер/Ext/Module.bsl
Процедура ЗаполнитьОстаткиПоТоварамВТЧ(ТабличнаяЧасть, Организация, Склад, Дата, ДокументРезерва = Неопределено) Экспорт
	
	ДатаОстатка = Дата;
	Если ДатаОстатка = Дата(1,1,1) Тогда
		ДатаОстатка = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДокумента",			ТабличнаяЧасть.Выгрузить());
	Запрос.УстановитьПараметр("Организация",				Организация);
	Запрос.УстановитьПараметр("Склад",						Склад);
	Запрос.УстановитьПараметр("ИспользуютсяОбщиеСклады", 	Константы.ОбщиеСклады.Получить());
	Запрос.УстановитьПараметр("ИспользоватьРезервирование", ПолучитьФункциональнуюОпцию("ИспользоватьРезервирование"));
	Запрос.УстановитьПараметр("ДатаГраница",				Новый Граница(ДатаОстатка, ВидГраницы.Исключая)); 
	Запрос.УстановитьПараметр("УказанДокументРезерва",   	ДокументРезерва = Неопределено);
	Запрос.УстановитьПараметр("ДокументРезерва",			ДокументРезерва);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЗ_ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТЗ_ТаблицаДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТЗ_ТаблицаДокумента.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ТЗ_ТаблицаДокумента.Количество КАК Количество,
	|	ТЗ_ТаблицаДокумента.Коэффициент КАК Коэффициент
	|ПОМЕСТИТЬ ВремТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТЗ_ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ВремТаблицаДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВремТаблицаДокумента.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ВремТаблицаДокумента.Коэффициент <> 0
	|			ТОГДА ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) / ВремТаблицаДокумента.Коэффициент
	|		ИНАЧЕ ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0)
	|	КОНЕЦ КАК ОстатокНаСкладе,
	|	ВЫБОР
	|		КОГДА &ИспользоватьРезервирование
	|			ТОГДА ВЫБОР
	|					КОГДА ВремТаблицаДокумента.Коэффициент <> 0
	|						ТОГДА ЕСТЬNULL(ВРезервеОстатки.КоличествоОстаток, 0) / ВремТаблицаДокумента.Коэффициент
	|					ИНАЧЕ ЕСТЬNULL(ВРезервеОстатки.КоличествоОстаток, 0)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВРезерве
	|ИЗ
	|	ВремТаблицаДокумента КАК ВремТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&ДатаГраница,
	|				ВЫБОР
	|						КОГДА &ИспользуютсяОбщиеСклады
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ Организация = &Организация
	|					КОНЕЦ
	|					И Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ПО ВремТаблицаДокумента.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И ВремТаблицаДокумента.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|			И ВремТаблицаДокумента.СерияНоменклатуры = ТоварыНаСкладахОстатки.СерияНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|				&ДатаГраница,
	|				Склад = &Склад
	|					И ВЫБОР
	|						КОГДА &ИспользуютсяОбщиеСклады
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ Организация = &Организация
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &УказанДокументРезерва
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ДокументРезерва <> &ДокументРезерва
	|					КОНЕЦ) КАК ВРезервеОстатки
	|		ПО ВремТаблицаДокумента.Номенклатура = ВРезервеОстатки.Номенклатура
	|			И ВремТаблицаДокумента.ХарактеристикаНоменклатуры = ВРезервеОстатки.ХарактеристикаНоменклатуры
	|			И ВремТаблицаДокумента.СерияНоменклатуры = ВРезервеОстатки.СерияНоменклатуры";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекущаяСтрока Из ТабличнаяЧасть Цикл
		Отбор = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры");
		ЗаполнитьЗначенияСвойств(Отбор, ТекущаяСтрока);
		НайденныеСтроки = РезультатЗапроса.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ТекущаяСтрока.ОстатокНаСкладе = НайденныеСтроки[0].ОстатокНаСкладе;
			ТекущаяСтрока.ВРезерве = НайденныеСтроки[0].ВРезерве;
		Иначе
			ТекущаяСтрока.ОстатокНаСкладе = 0;
			ТекущаяСтрока.ВРезерве = 0;
		КонецЕсли;
		
		ТекущаяСтрока.Доступно = ТекущаяСтрока.ОстатокНаСкладе - ТекущаяСтрока.ВРезерве;		
	КонецЦикла;
	
КонецПроцедуры
